tsung/config/scenario1.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0" dumptraffic="false">

    <!-- Клиенты -->
    <clients>
        <client host="localhost"
                use_controller_vm="true"
                maxusers="1000"
                cpu="2"/>
    </clients>

    <!-- Серверы -->
    <servers>
        <server host="swipe-service"
                port="8081"
                type="tcp"/>
    </servers>

    <!-- Профиль нагрузки -->
    <load>
        <arrivalphase phase="1" duration="6" unit="second">
            <users maxnumber="400" arrivalrate="80" unit="second"/>
        </arrivalphase>
    </load>

    <!-- Общие настройки -->
    <options>
        <option name="thinktime" value="random_uniform(1,8)"/>
        <option name="user_agent" value="Mozilla/5.0 (X11; Linux x86_64)"/>
        <option name="tcp_snd_buffer" value="16384"/>
        <option name="tcp_rcv_buffer" value="32768"/>
    </options>

    <!-- Динамические данные -->
    <setdynvars sourcetype="csv"
                file="/tsung/config/swipes_half_mutual.csv"
                delimiter=","
                order="iter">
        <var name="swiperId"/>
        <var name="targetId"/>
        <var name="direction"/>
    </setdynvars>

    <!-- Сессии пользователей -->
    <sessions>
        <session name="swipe-session" probability="100" type="ts_http">

            <!-- Инициализация переменных ДО цикла -->
<!--            <setdynvars sourcetype="random_number" start="100000" end="999999">-->
<!--                <var name="session_id"/>-->
<!--            </setdynvars>-->

            <for from="1" to="10" incr="1" var="iteration">
                <!-- Динамические переменные внутри цикла должны быть перед request -->
                <setdynvars sourcetype="random_number" start="1" end="3">
                    <var name="delay_before"/>
                </setdynvars>

                <request subst="true">
                    <http url="/api/swipes"
                          method="POST"
                          version="1.1"
                          content_type="application/json"
                          contents='{
                            "swiperId": "%%_swiperId%%",
                            "targetId": "%%_targetId%%",
                            "direction": "%%_direction%%"
                          }'>
                    </http>
                </request>
            </for>
        </session>
    </sessions>
</tsung>