tsung/config/scenario2.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true"/>
    </clients>

    <servers>
        <server host="swipe-service" port="8081" type="tcp"/>
    </servers>

    <load>
        <arrivalphase phase="1" duration="2m">
            <users arrivalrate="20" unit="second" maxnumber="50"/>
        </arrivalphase>
    </load>

    <options>
        <option name="host" value="swipe-service"/>
        <option name="thinktime" value="uniform(0.1,0.5)"/>
    </options>

    <setdynvars sourcetype="csv" file="/root/.tsung/swipes_half_mutual.csv" delimiter=",">
        <var name="swiperId"/>
        <var name="targetId"/>
        <var name="direction"/>
    </setdynvars>

    <sessions>
        <session name="scenario2" probability="100" type="ts_http">
            <request>
                <http url="/api/swipes" method="POST">
                    <http_headers>
                        <header name="Content-Type" value="application/json"/>
                    </http_headers>
                    <body>
                        <![CDATA[
              {
                "swiperId": "${swiperId}",
                "targetId": "${targetId}",
                "direction": "${direction}"
              }
            ]]>
                    </body>
                </http>
            </request>
        </session>
    </sessions>
</tsung>